# Most important stuff
cask "iterm2"
cask "alfred"
cask "spectacle"
cask "docker"
brew "tmux"

# Apps
cask "slack"
cask "firefox"
brew "notmuch"
brew "jq"
# Games
cask "steam"
cask "discord"

# Dev tools
cask "emacs"
cask "intellij-idea-ce"
brew "ag"
brew "python"
brew "pyenv-virtualenvwrapper"
cask "google-chrome"
brew "xhyve"
brew "dive" # Nice tool for inspecting docker images
brew "reattach-to-user-namespace"
brew "gitup"
brew "lazydocker"
brew "yank"
brew "jo"
brew "docker-compose"

cask "google-cloud-sdk"
brew "node"
brew "skaffold"

# Command line
brew "fish"

# Utils
brew "htop"
brew "wtfutil"

cask "gpg-suite"
cask "discord"
cask "docker"

cask "hammerspoon"
