# Most important stuff
cask "iterm2"
cask "alfred"
brew "tmux"

# Apps
cask "slack"
cask "firefox"
brew "jq"
# Games
cask "steam"
cask "discord"

# Dev tools
cask "emacs"
brew "ripgrep"
brew "python"
cask "google-chrome"
brew "dive" # Nice tool for inspecting docker images
brew "reattach-to-user-namespace"
brew "lazydocker"
brew "docker-compose"

brew "node"

# Command line
brew "fish"

# Utils
brew "htop"
brew "wtfutil"

cask "hammerspoon"
